Расширение/Расширение/DataProcessors/ОтображениеДокументовПоСерийникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтображениеДокументовПоСерийникам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Расширение/Расширение/InformationRegisters/СерийныеНомераНаПечать.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СерийныеНомераНаПечать</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДобавленныйСерийныйНомер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_СканированиеНомеровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.B1_ГенерацияСерийныхНомеров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение/Расширение/DataProcessors/ОтображениеДокументовПоСерийникам/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнениеДокументов(Команда)
	ЗаполнениеДокументовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеДокументовНаСервере() 
	
	
	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаСерийников.Область());
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();   
	
	Выборка = ПЗ.Результат.Выгрузить();
	
	ТаблицаСерийныеНомера.Очистить();
	
	Для Каждого Строка из Выборка Цикл
		
		Если ТолькоРеализации Тогда
			
			Запрос2 = Новый Запрос("
			|ВЫБРАТЬ
			|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер,
			|	СерийныеНомераНаПечать.Реализация КАК Реализация
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
			|ГДЕ
			|	СерийныеНомераНаПечать.СерийныйНомер = &СерийныйНомер
			|	И СерийныеНомераНаПечать.Реализация ССЫЛКА Документ.РеализацияТоваровУслуг"); 
			
			Запрос2.УстановитьПараметр("СерийныйНомер", Строка.СерийныеНомера);			
			
			РезультатЗапроса = Запрос2.Выполнить().Выгрузить(); 
			
			Для каждого СтрокаРезультата из РезультатЗапроса Цикл
				
				НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
				НоваяСтрока.СерийныеНомера = СтрокаРезультата.СерийныйНомер;
				НоваяСтрока.ДокументРеализации = СтрокаРезультата.Реализация;
				
			КонецЦикла;	
			
		Иначе
			
			Запрос2 = Новый Запрос("
			|ВЫБРАТЬ
			|	СерийныеНомераНаПечать.СерийныйНомер КАК СерийныйНомер,
			|	СерийныеНомераНаПечать.Реализация КАК Реализация
			|ИЗ
			|	РегистрСведений.СерийныеНомераНаПечать КАК СерийныеНомераНаПечать
			|ГДЕ
			|	СерийныеНомераНаПечать.СерийныйНомер = &СерийныйНомер");
			
			Запрос2.УстановитьПараметр("СерийныйНомер", Строка.СерийныеНомера);			
			
			РезультатЗапроса = Запрос2.Выполнить().Выгрузить(); 
			
			Если РезультатЗапроса.Количество() = 0 Тогда 
				
				НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
				НоваяСтрока.СерийныеНомера = Строка.СерийныеНомера;
				НоваяСтрока.ДокументРеализации = "Документ не найден";
				
			Иначе 
				
				Для каждого СтрокаРезультата из РезультатЗапроса Цикл
					
					НоваяСтрока = ТаблицаСерийныеНомера.Добавить(); 
					НоваяСтрока.СерийныеНомера = СтрокаРезультата.СерийныйНомер;
					НоваяСтрока.ДокументРеализации = СтрокаРезультата.Реализация;
					
				КонецЦикла;	
				
			КонецЕсли;			
			
		КонецЕсли; 	
		
	КонецЦикла;
	
КонецПроцедуры
